In [1]:
pip install ucimlrepo

Requirement already satisfied: ucimlrepo in c:\users\sande\anaconda3\lib\site-packages (0.0.7)
Requirement already satisfied: pandas>=1.0.0 in c:\users\sande\anaconda3\lib\site-packages (from ucimlrepo) (2.0.3)
Requirement already satisfied: certifi>=2020.12.5 in c:\users\sande\anaconda3\lib\site-packages (from ucimlrepo) (2023.11.17)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sande\anaconda3\lib\site-packages (from pandas>=1.0.0->ucimlrepo) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\sande\anaconda3\lib\site-packages (from pandas>=1.0.0->ucimlrepo) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\sande\anaconda3\lib\site-packages (from pandas>=1.0.0->ucimlrepo) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\sande\anaconda3\lib\site-packages (from pandas>=1.0.0->ucimlrepo) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\sande\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas>=1.0.0->ucimlrepo) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
from ucimlrepo import fetch_ucirepo 
  
# fetch dataset 
adult = fetch_ucirepo(id=2) 
  
df_adult = adult.data.original

#Display the data
df_adult

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,39,Private,215419,Bachelors,13,Divorced,Prof-specialty,Not-in-family,White,Female,0,0,36,United-States,<=50K.
48838,64,NaN,321403,HS-grad,9,Widowed,NaN,Other-relative,Black,Male,0,0,40,United-States,<=50K.
48839,38,Private,374983,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States,<=50K.
48840,44,Private,83891,Bachelors,13,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455,0,40,United-States,<=50K.
48841,35,Self-emp-inc,182148,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States,>50K.

#Export the dataframe to an excel file
df_adult.to_excel('adult.xlsx', index=False)

In [10]:
#display first few rows of the adult dataset using head() function
df_adult.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [15]:
#display first few rows of the adult dataset using sample() function
df_adult.sample(5)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
9461,22,Private,249727,Some-college,10,Never-married,Adm-clerical,Own-child,White,Male,0,0,30,United-States,<=50K
27521,47,Private,110669,Bachelors,13,Separated,Prof-specialty,Unmarried,White,Female,0,0,50,United-States,<=50K
9405,45,Local-gov,175958,9th,5,Never-married,Other-service,Own-child,White,Male,0,0,40,United-States,<=50K
4338,34,Self-emp-inc,186824,Prof-school,15,Married-civ-spouse,Prof-specialty,Husband,White,Male,15024,0,40,United-States,>50K
21503,35,Private,93034,HS-grad,9,Never-married,Machine-op-inspct,Not-in-family,Asian-Pac-Islander,Male,0,0,40,Cambodia,<=50K

In [4]:
#Examine the columns and their datatypes
df_adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             48842 non-null  int64
 1   workclass       47879 non-null  object
 2   fnlwgt          48842 non-null  int64
 3   education       48842 non-null  object
 4   education-num   48842 non-null  int64
 5   marital-status  48842 non-null  object
 6   occupation      47876 non-null  object
 7   relationship    48842 non-null  object
 8   race            48842 non-null  object
 9   sex             48842 non-null  object
 10  capital-gain    48842 non-null  int64
 11  capital-loss    48842 non-null  int64
 12  hours-per-week  48842 non-null  int64
 13  native-country  48568 non-null  object
 14  income          48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [19]:
#check for missing values using isnull() function
df_adult.isnull().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64

In [22]:
#Investigate basic summary statistics for the numerical columns
df_adult.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,48842.000000,48842.000000,48842.000000,48842.000000
mean,38.643585,1.896641e+05,10.078089,1079.067626,87.502314,40.422382
std,13.710510,1.056040e+05,2.570973,7452.019058,403.004552,12.391444
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

In [25]:
#get summary summary statistics for the categorical columns
df_adult.describe(include='object')

,workclass,education,marital-status,occupation,relationship,race,sex,native-country,income
count,47879,48842,48842,47876,48842,48842,48842,48568,48842
unique,9,16,7,15,6,5,2,42,4
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,33906,15784,22379,6172,19716,41762,32650,43832,24720

# **Data Cleaning**

In [162]:
#replace values "<=50K." and ">50K." with "<=50K" and ">50K" respectively
df_adult_clean = df_adult.replace({'<=50K.' : '<=50K',
                                   '>50K.' : '>50K'})

#retrieve the unique values in the 'income' column after replacement
df_adult_clean['income'].unique()

array(['<=50K', '>50K'], dtype=object)

## Handle missing values

In [73]:
#check for missing values using isnull() function
df_adult.isnull().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
income              0
dtype: int64

In [170]:
import numpy as np
#replace "?" with nan
df_adult_clean.replace('?', np.nan, inplace=True)

#check for occurences of "?"
df_adult_clean.isin(['?']).sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

In [172]:
#check for missing values using isnull() function
df_adult_clean.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation        2809
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country     857
income               0
dtype: int64

In [174]:
#Impute missing values for categorical columns using mode() method

#Impute missing values in "workclass" column
mode_workclass= df_adult_clean.filter(["workclass", "education-num"]).mode()
print(mode_workclass)

cols = ["workclass", "education-num"]
df_adult_clean[cols]=df_adult_clean[cols].fillna(mode_workclass.iloc[0])

#check the missing values in workclass column
df_adult_clean['workclass'].isnull().sum()

  workclass  education-num
0   Private              9

0

In [176]:
#Impute missing values in "native-country" column
mode_country= df_adult_clean.filter(["workclass", "native-country"]).mode()
print(mode_country)

cols_1 = ["workclass", "native-country"]
df_adult_clean[cols_1]=df_adult_clean[cols_1].fillna(mode_country.iloc[0])

#check the missing values in workclass column
df_adult_clean['native-country'].isnull().sum()

  workclass native-country
0   Private  United-States

0

In [178]:
#Fill missing values in the "occupation" column using mode() method
df_adult_clean['occupation'] = df_adult_clean['occupation'].fillna(df_adult_clean['occupation'].mode().iloc[0])

#check for null values
df_adult_clean.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

## *Remove whitespaces and standardize text*

In [130]:
import pandas as pd

# Identify categorical columns
categorical_cols = df_adult_clean.select_dtypes(include=['object']).columns

# Remove whitespaces and standardize text
for col in categorical_cols:
    df_adult_clean[col] = df_adult_clean[col].str.strip().str.lower()
    

# Verify changes
for col in categorical_cols:
    unique_values = df_adult_clean[col].unique()
    print(f"{col}: {unique_values}\n")

workclass: ['state-gov' 'self-emp-not-inc' 'private' 'federal-gov' 'local-gov'
 'self-emp-inc' 'without-pay' 'never-worked']

education: ['bachelors' 'hs-grad' '11th' 'masters' '9th' 'some-college' 'assoc-acdm'
 'assoc-voc' '7th-8th' 'doctorate' 'prof-school' '5th-6th' '10th'
 '1st-4th' 'preschool' '12th']

marital-status: ['never-married' 'married-civ-spouse' 'divorced' 'married-spouse-absent'
 'separated' 'married-af-spouse' 'widowed']

occupation: ['adm-clerical' 'exec-managerial' 'handlers-cleaners' 'prof-specialty'
 'other-service' 'sales' 'craft-repair' 'transport-moving'
 'farming-fishing' 'machine-op-inspct' 'tech-support' 'protective-serv'
 'armed-forces' 'priv-house-serv']

relationship: ['not-in-family' 'husband' 'wife' 'own-child' 'unmarried' 'other-relative']

race: ['white' 'black' 'asian-pac-islander' 'amer-indian-eskimo' 'other']

sex: ['male' 'female']

native-country: ['united-states' 'cuba' 'jamaica' 'india' 'mexico' 'south' 'puerto-rico'
 'honduras' 'england' 'canada' 'germany' 'iran' 'philippines' 'italy'
 'poland' 'columbia' 'cambodia' 'thailand' 'ecuador' 'laos' 'taiwan'
 'haiti' 'portugal' 'dominican-republic' 'el-salvador' 'france'
 'guatemala' 'china' 'japan' 'yugoslavia' 'peru'
 'outlying-us(guam-usvi-etc)' 'scotland' 'trinadad&tobago' 'greece'
 'nicaragua' 'vietnam' 'hong' 'ireland' 'hungary' 'holand-netherlands']

income: ['<=50k' '>50k']

## *Correct data types*

In [137]:
df_adult_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             48842 non-null  int64
 1   workclass       48842 non-null  object
 2   fnlwgt          48842 non-null  int64
 3   education       48842 non-null  object
 4   education-num   48842 non-null  int64
 5   marital-status  48842 non-null  object
 6   occupation      48842 non-null  object
 7   relationship    48842 non-null  object
 8   race            48842 non-null  object
 9   sex             48842 non-null  object
 10  capital-gain    48842 non-null  int64
 11  capital-loss    48842 non-null  int64
 12  hours-per-week  48842 non-null  int64
 13  native-country  48842 non-null  object
 14  income          48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [142]:
#convert categorical columns to category dtype
for col in categorical_cols:
    df_adult_clean[col] = df_adult_clean[col].astype('category')

df_adult_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             48842 non-null  int64
 1   workclass       48842 non-null  category
 2   fnlwgt          48842 non-null  int64
 3   education       48842 non-null  category
 4   education-num   48842 non-null  int64
 5   marital-status  48842 non-null  category
 6   occupation      48842 non-null  category
 7   relationship    48842 non-null  category
 8   race            48842 non-null  category
 9   sex             48842 non-null  category
 10  capital-gain    48842 non-null  int64
 11  capital-loss    48842 non-null  int64
 12  hours-per-week  48842 non-null  int64
 13  native-country  48842 non-null  category
 14  income          48842 non-null  category
dtypes: category(9), int64(6)
memory usage: 2.7 MB

## *Map categorical columns: Age, education,workclass to smaller category set*

In [158]:
#Map workclass column to smaller category set
df_adult_clean['employment-type'] = None

df_adult_clean.loc[df_adult_clean['workclass'].isin(['Federal-gov', 'Local-gov' , 'State-gov']), 
      'employment-type'] = 'Government'
df_adult_clean.loc[df_adult_clean['workclass'].isin(['Self-emp-inc' , 'Self-emp-not-inc']),      
      'employment-type'] = 'Self-Employed'
df_adult_clean.loc[df_adult_clean['workclass'].isin(['Private' , 'Without-pay']),                               
      'employment-type'] = 'Privately-Employed'
df_adult_clean['employment-type'].unique()

['state-gov', 'self-emp-not-inc', 'private', 'federal-gov', 'local-gov', 'self-emp-inc', 'without-pay', 'never-worked']
Categories (8, object): ['federal-gov', 'local-gov', 'never-worked', 'private', 'self-emp-inc', 'self-emp-not-inc', 'state-gov', 'without-pay']

In [180]:
df_adult_clean['workclass'].unique()

array(['State-gov', 'Self-emp-not-inc', 'Private', 'Federal-gov',
       'Local-gov', 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)